ka2_2024/src/Documents/ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество/ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество</name>
  <registerRecords>InformationRegister.ИсправлениеПараметровНалогаНаИмущество</registerRecords>
  <registerRecords>InformationRegister.ПараметрыНачисленияНалогаНаИмущество</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоИмущественнымНалогам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказаныСпособыОтражениеРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРегистрации</name>
    <attributes>
      <name>ДатаПараметров</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСобственность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимостиЧислитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимостиЗнаменатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КадастровыйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КадастровыйНомерПомещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КадастроваяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НеоблагаемаяКадастроваяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииПраваСобственности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрекращенияПраваСобственности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтноситсяКТерриторииСубъектаРФВДоле</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КадастроваяСтоимостьОпределенаПоДолеПлощади</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляПлощадиЧислитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляПлощадиЗнаменатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляВПравеОбщейСобственностиЗнаменатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляВПравеОбщейСобственностиЧислитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыНалога</name>
    <attributes>
      <name>ДатаПараметров</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеПодлежитНалогообложению</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяБаза</name>
      <type>
        <types>EnumRef.НалоговаяБазаПоНалогуНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВидаИмущества</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЛьготы</name>
      <type>
        <types>CatalogRef.ОснованияЛьготПоИмущественнымНалогам</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействияЛьготы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДействияЛьготы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СниженнаяНалоговаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУменьшения</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалоговыйОрган</name>
    <attributes>
      <name>ДатаПараметров</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПостановкаНаУчетВНалоговомОргане</name>
      <type>
        <types>EnumRef.ПостановкаНаУчетВНалоговомОргане</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговыйОрган</name>
      <type>
        <types>CatalogRef.РегистрацииВНалоговомОргане</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПоОКТМО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтоимостьИАмортизация</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтражениеРасходов</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Documents/ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		ЗаполнитьНаОснованииОбъектаЭксплуатации(ДанныеЗаполнения);
	КонецЕсли;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПараметрыНачисленияЗемельногоНалога.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ЗаполнитьРеквизитыПередЗаписью();
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьНаличиеПараметровНаДату(Отказ);
	КонецЕсли;

	ПараметрыВыбораСтатейИАналитик = Документы.ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ПроверитьРеквизиты(НепроверяемыеРеквизиты, Отказ);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(
		НСтр("ru = 'Ввод первоначальных сведений для расчета налога на имущество'"));
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Ответственный = Пользователи.ТекущийПользователь();
	
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПередЗаписью()
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));

	ПараметрыРеквизитовОбъекта = ИмущественныеНалогиКлиентСервер.НастройкаРеквизитов_ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество(ЭтотОбъект);
	ОбщегоНазначенияУТКлиентСервер.ОчиститьНеиспользуемыеРеквизиты(
		ЭтотОбъект, ПараметрыРеквизитовОбъекта, "ПараметрыРегистрации,ПараметрыНалога,НалоговыйОрган,СтоимостьИАмортизация");

	УказаныСпособыОтражениеРасходов = (ОтражениеРасходов.Количество() <> 0);
	
	Для Каждого ДанныеСтроки Из ПараметрыРегистрации Цикл

		Если УчетСНачалаГода Тогда
			ДанныеСтроки.ДатаПараметров = КонецМесяца(Дата) + 1;
		КонецЕсли;
		
		Если Не ДанныеСтроки.ОбщаяСобственность Тогда
			ДанныеСтроки.ДоляВПравеОбщейСобственностиЧислитель = 0;
			ДанныеСтроки.ДоляВПравеОбщейСобственностиЗнаменатель = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из ПараметрыНалога Цикл
		
		Если УчетСНачалаГода Тогда
			ДанныеСтроки.ДатаПараметров = КонецМесяца(Дата) + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из НалоговыйОрган Цикл
		
		Если УчетСНачалаГода Тогда
			ДанныеСтроки.ДатаПараметров = КонецМесяца(Дата) + 1;
		КонецЕсли;

		Если ДанныеСтроки.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО
			И ДанныеСтроки.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане Тогда
			
			ДанныеСтроки.КодПоОКТМО = "";
		КонецЕсли;
		
		Если ДанныеСтроки.ПостановкаНаУчетВНалоговомОргане <> Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане Тогда
			ДанныеСтроки.НалоговыйОрган = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Основание)

	Если Основание.Свойство("Дата") Тогда
		Дата = Основание.Дата;
	КонецЕсли;
	
	Если Основание.Свойство("Организация")
		И ЗначениеЗаполнено(Основание.Организация) Тогда
		Организация = Основание.Организация;
	КонецЕсли;

	Если Основание.Свойство("ОсновноеСредство") Тогда
		ЗаполнитьНаОснованииОбъектаЭксплуатации(Основание.ОсновноеСредство);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииОбъектаЭксплуатации(ДанныеЗаполнения)
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "ЭтоГруппа");
	
	Если РеквизитыОснования.ЭтоГруппа Тогда
		
		ТекстСообщения = НСтр("ru = 'Оформление документа на основании группы ОС невозможен.
			|Выберите ОС. Для раскрытия группы используйте клавиши Ctrl и стрелку вниз.'");
			
		ВызватьИсключение(ТекстСообщения);
		
	КонецЕсли;
	
	ОсновноеСредство = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ПроверитьРеквизиты(НепроверяемыеРеквизиты, Отказ)
	
	ПараметрыРеквизитовОбъекта = ИмущественныеНалогиКлиентСервер.НастройкаРеквизитов_ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество(
									ЭтотОбъект);
									
	ОбщегоНазначенияУТ.ОтключитьПроверкуЗаполненияРеквизитовОбъекта(ПараметрыРеквизитовОбъекта, НепроверяемыеРеквизиты);

	ПроверитьДатыПараметров(НепроверяемыеРеквизиты, Отказ);
	
	ПроверитьПараметрыРегистрации(НепроверяемыеРеквизиты, Отказ);
	ПроверитьПараметрыНалога(НепроверяемыеРеквизиты, Отказ);
	ПроверитьНалоговыйОрган(НепроверяемыеРеквизиты, Отказ);
	ПроверитьСтоимостьИАмортизацию(НепроверяемыеРеквизиты, Отказ);	
	
КонецПроцедуры

Процедура ПроверитьДатыПараметров(НепроверяемыеРеквизиты, Отказ)
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));

	Если УчетСНачалаГода Тогда
		
		НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДатаПараметров");
		НепроверяемыеРеквизиты.Добавить("ПараметрыНалога.ДатаПараметров");
		НепроверяемыеРеквизиты.Добавить("НалоговыйОрган.ДатаПараметров");
		
		Возврат;
		
	КонецЕсли;

	МинимальнаяДата = '000101010000';
	НачалоГода = НачалоГода(Дата);
	
	Для Каждого ДанныеСтроки Из ПараметрыРегистрации Цикл
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДатаПараметров) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.ДатаПараметров < НачалоГода Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата сведений о регистрации должна быть не раньше начала года %1'"),
				Формат(НачалоГода, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		ИначеЕсли ДанныеСтроки.ДатаПараметров > КонецДня(Дата) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата сведений о регистрации должна быть не позже даты документа %1'"),
				Формат(Дата, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		МинимальнаяДата = ?(МинимальнаяДата <> '000101010000', 
							Мин(ДанныеСтроки.ДатаПараметров, МинимальнаяДата), 
							ДанныеСтроки.ДатаПараметров);
		
	КонецЦикла;
		
	Для Каждого ДанныеСтроки Из ПараметрыНалога Цикл
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДатаПараметров) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.ДатаПараметров < НачалоГода Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата параметров начисления налога должна быть не раньше начала года %1'"),
				Формат(НачалоГода, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыНалога", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		ИначеЕсли ДанныеСтроки.ДатаПараметров > КонецДня(Дата) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата параметров начисления налога должна быть не позже даты документа %1'"),
				Формат(Дата, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыНалога", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		МинимальнаяДата = ?(МинимальнаяДата <> '000101010000', 
							Мин(ДанныеСтроки.ДатаПараметров, МинимальнаяДата), 
							ДанныеСтроки.ДатаПараметров);
		
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из НалоговыйОрган Цикл

		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДатаПараметров) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.ДатаПараметров < НачалоГода Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата регистрации в налоговом органе должна быть не раньше начала года %1'"),
				Формат(НачалоГода, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"НалоговыйОрган", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		ИначеЕсли ДанныеСтроки.ДатаПараметров > КонецДня(Дата) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата регистрации в налоговом органе должна быть не позже даты документа %1'"),
				Формат(Дата, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"НалоговыйОрган", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		МинимальнаяДата = ?(МинимальнаяДата <> '000101010000', 
							Мин(ДанныеСтроки.ДатаПараметров, МинимальнаяДата), 
							ДанныеСтроки.ДатаПараметров);

	КонецЦикла;
	
	Если МинимальнаяДата <> '000101010000' Тогда
		
		МинимальнаяДата = Макс(МинимальнаяДата, НачалоГода);
		
		Если ПараметрыРегистрации.Найти(МинимальнаяДата, "ДатаПараметров") = Неопределено Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В списке ""Сведения о регистрации"" необходимо указать параметры на дату %1'"), 
				Формат(МинимальнаяДата, "ДЛФ=D;"));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыРегистрации",, Отказ);
			
		КонецЕсли;
		
		Если ПараметрыНалога.Найти(МинимальнаяДата, "ДатаПараметров") = Неопределено Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В списке ""Налог на имущество"" необходимо указать параметры на дату %1'"), 
				Формат(МинимальнаяДата, "ДЛФ=D;"));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыНалога",, Отказ);
			
		КонецЕсли;
		
		Если НалоговыйОрган.Найти(МинимальнаяДата, "ДатаПараметров") = Неопределено Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В списке ""Налоговый орган"" необходимо указать параметры на дату %1'"), 
				Формат(МинимальнаяДата, "ДЛФ=D;"));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НалоговыйОрган",, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПараметрыРегистрации(НепроверяемыеРеквизиты, Отказ)
	
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляВПравеОбщейСобственностиЧислитель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляВПравеОбщейСобственностиЗнаменатель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляСтоимостиЧислитель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляСтоимостиЗнаменатель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляПлощадиЧислитель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляПлощадиЗнаменатель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДатаРегистрацииПравНаОбъектНедвижимости");
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));

	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%1"" в строке %2 списка ""Сведения об имуществе""'");
	
	Если УчетСНачалаГода И ПараметрыРегистрации.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru='При учете с начала года вводится только одна строка сведений об имуществе'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыРегистрации",, Отказ);
		
	Иначе
		
		ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ПараметрыРегистрации", "ДатаПараметров", Отказ);
	
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из ПараметрыРегистрации Цикл
		
		Если ДанныеСтроки.ОбщаяСобственность Тогда
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляВПравеОбщейСобственностиЧислитель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Числитель доли в праве общей собственности'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляВПравеОбщейСобственностиЧислитель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляВПравеОбщейСобственностиЗнаменатель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Знаменатель доли в праве общей собственности'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляВПравеОбщейСобственностиЗнаменатель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
				
		Если ДанныеСтроки.КадастроваяСтоимостьОпределенаПоДолеПлощади Тогда
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляПлощадиЧислитель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Доля площади (числитель)'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляПлощадиЧислитель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляПлощадиЗнаменатель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Доля площади (знаменатель)'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляПлощадиЗнаменатель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;

		Если ДанныеСтроки.ОтноситсяКТерриторииСубъектаРФВДоле Тогда
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляСтоимостиЧислитель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Доля стоимости (числитель)'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляСтоимостиЧислитель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляСтоимостиЗнаменатель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Доля стоимости (знаменатель)'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляСтоимостиЗнаменатель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПараметрыНалога(НепроверяемыеРеквизиты, Отказ)
	
	НепроверяемыеРеквизиты.Добавить("ПараметрыНалога.НалоговаяСтавка");
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));

	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%1"" в строке %2 списка ""Налог на имущество""'");
	
	Если УчетСНачалаГода И ПараметрыНалога.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru='При учете с начала года вводится только одна строка параметров налога'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыНалога",, Отказ);
		
	Иначе
		
		ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ПараметрыНалога", "ДатаПараметров", Отказ);
	
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из ПараметрыНалога Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеСтроки.НалоговаяСтавка)
			И ДанныеСтроки.НалоговаяБаза = Перечисления.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость Тогда
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Налоговая ставка'"), ДанныеСтроки.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыНалога", ДанныеСтроки.НомерСтроки, "НалоговаяСтавка");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНалоговыйОрган(НепроверяемыеРеквизиты, Отказ)
	
	НепроверяемыеРеквизиты.Добавить("НалоговыйОрган.НалоговаяСтавка");
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));
	
	Если УчетСНачалаГода И НалоговыйОрган.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru='При учете с начала года вводится только одна строка параметров налогового органа'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НалоговыйОрган",, Отказ);
		
	Иначе
		
		ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "НалоговыйОрган", "ДатаПараметров", Отказ);
		
	КонецЕсли;
	
	ИмущественныеНалоги.ПроверитьНалоговыйОрган(ЭтотОбъект, НепроверяемыеРеквизиты, Отказ);
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%1"" в строке %2 списка ""Налоговый орган""'");
	
	ОпределениеНалоговойБазыПоКадастровойСтоимости = Ложь;
	
	Для Каждого ДанныеСтроки Из ПараметрыНалога Цикл
		Если ДанныеСтроки.НалоговаяБаза = ПредопределенноеЗначение("Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость") Тогда
			ОпределениеНалоговойБазыПоКадастровойСтоимости = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из НалоговыйОрган Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеСтроки.НалоговаяСтавка)
			И ДанныеСтроки.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане
			И НЕ ОпределениеНалоговойБазыПоКадастровойСтоимости Тогда
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Налоговая ставка'"), ДанныеСтроки.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"НалоговыйОрган", ДанныеСтроки.НомерСтроки, "НалоговаяСтавка");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСтоимостьИАмортизацию(НепроверяемыеРеквизиты, Отказ)
	
	НепроверяемыеРеквизиты.Добавить("СтоимостьИАмортизация.Дата");

	ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "СтоимостьИАмортизация", "Дата", Отказ,, "МЕСЯЦ");
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%1"" в строке %2 списка ""Стоимость и амортизация""'");
	
	Для Каждого ДанныеСтроки Из СтоимостьИАмортизация Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеСтроки.Дата) Тогда
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Месяц'"), ДанныеСтроки.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"СтоимостьИАмортизация", ДанныеСтроки.НомерСтроки, "МесяцТекст");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПараметровНаДату(Отказ)

	СписокЗапросов = Новый СписокЗначений();
	
	Документы.ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество.ТекстЗапросаТаблицаВтДатыПараметровПоследние(СписокЗапросов);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеРегистра.ОсновноеСредство.Представление КАК ОсновноеСредствоПредставление
	|ИЗ
	|	втДатыПараметровПоследние КАК втДатыПараметровПоследние
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыНачисленияНалогаНаИмущество КАК ДанныеРегистра
	|		ПО ДанныеРегистра.Период = НАЧАЛОПЕРИОДА(втДатыПараметровПоследние.Дата, ДЕНЬ)
	|			И ДанныеРегистра.Регистратор <> &Ссылка
	|			И ДанныеРегистра.Организация = &Организация
	|			И ДанныеРегистра.ОсновноеСредство = &ОсновноеСредство
	|			И ДанныеРегистра.Активность
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(КонецДня(Дата) + 1));
	
	ШаблонСообщения = НСтр("ru = 'Для основного средства ""%1"" уже введены параметры на %2 документом %3.
						   |Не поддерживается ввод параметров на одну дату разными документами.'");
	
	Результаты = ОбщегоНазначенияУТ.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	Выборка = Результаты[Результаты.ВГраница()].Выбрать();

	Если Выборка.Следующий() Тогда
	
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОсновноеСредствоПредставление, Формат(Выборка.Период, "ДЛФ=D;"), Выборка.Регистратор);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ОсновноеСредство",, Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
